; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p4---int100n150-m25---int100c150---s15---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level25 level25)
(sum level1 level4 level5)
(sum level1 level25 level26)
(sum level2 level4 level6)
(sum level2 level25 level27)
(sum level3 level4 level7)
(sum level3 level25 level28)
(sum level4 level4 level8)
(sum level4 level25 level29)
(sum level5 level4 level9)
(sum level5 level25 level30)
(sum level6 level4 level10)
(sum level6 level25 level31)
(sum level7 level4 level11)
(sum level7 level25 level32)
(sum level8 level4 level12)
(sum level8 level25 level33)
(sum level9 level4 level13)
(sum level9 level25 level34)
(sum level10 level4 level14)
(sum level10 level25 level35)
(sum level11 level4 level15)
(sum level11 level25 level36)
(sum level12 level4 level16)
(sum level12 level25 level37)
(sum level13 level4 level17)
(sum level13 level25 level38)
(sum level14 level4 level18)
(sum level14 level25 level39)
(sum level15 level4 level19)
(sum level15 level25 level40)
(sum level16 level4 level20)
(sum level16 level25 level41)
(sum level17 level4 level21)
(sum level17 level25 level42)
(sum level18 level4 level22)
(sum level18 level25 level43)
(sum level19 level4 level23)
(sum level19 level25 level44)
(sum level20 level4 level24)
(sum level20 level25 level45)
(sum level21 level4 level25)
(sum level21 level25 level46)
(sum level22 level4 level26)
(sum level22 level25 level47)
(sum level23 level4 level27)
(sum level23 level25 level48)
(sum level24 level4 level28)
(sum level24 level25 level49)
(sum level25 level4 level29)
(sum level26 level4 level30)
(sum level27 level4 level31)
(sum level28 level4 level32)
(sum level29 level4 level33)
(sum level30 level4 level34)
(sum level31 level4 level35)
(sum level32 level4 level36)
(sum level33 level4 level37)
(sum level34 level4 level38)
(sum level35 level4 level39)
(sum level36 level4 level40)
(sum level37 level4 level41)
(sum level38 level4 level42)
(sum level39 level4 level43)
(sum level40 level4 level44)
(sum level41 level4 level45)
(sum level42 level4 level46)
(sum level43 level4 level47)
(sum level44 level4 level48)
(sum level45 level4 level49)

(connected l0 l1)
(fuelcost level4 l0 l1)
(connected l0 l2)
(fuelcost level25 l0 l2)
(connected l1 l0)
(fuelcost level4 l1 l0)
(connected l1 l2)
(fuelcost level25 l1 l2)
(connected l2 l0)
(fuelcost level25 l2 l0)
(connected l2 l1)
(fuelcost level25 l2 l1)

(at t0 l1)
(fuel t0 level49)
(= (total-cost) 0)

(at p0 l1)
(at p1 l0)
(at p2 l1)
(at p3 l1)
)

(:goal
(and
(at p0 l2)
(at p1 l1)
(at p2 l0)
(at p3 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 4
2. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 4
3. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 4
4. (drive t0 l1 l0 level45 level4 level49)
   deleted: (at t0 l1) (fuel t0 level49)
   added: (at t0 l0) (fuel t0 level45)
   goals met: 0 of 4
5. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 4
6. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 1 of 4
7. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 2 of 4
8. (drive t0 l0 l1 level41 level4 level45)
   deleted: (at t0 l0) (fuel t0 level45)
   added: (at t0 l1) (fuel t0 level41)
   goals met: 2 of 4
9. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 3 of 4
10. (drive t0 l1 l2 level16 level25 level41)
   deleted: (at t0 l1) (fuel t0 level41)
   added: (at t0 l2) (fuel t0 level16)
   goals met: 3 of 4
11. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 4 of 4
